Revit 2027 API
PolylineSegments.GetVertices Method
 Returns an array of vertices of the polyline segments.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<XYZ> GetVertices()
Public Function GetVertices As IList(Of XYZ)
public:
IList<XYZ^>^ GetVertices()
member GetVertices : unit -> IList<XYZ>
Return Value
IList<XYZ>
 Array of XYZ points.
See Also
Reference
PolylineSegments Class
Autodesk.Revit.DB Namespace